{"total":61,"items":[{"id":52,"name":"Wu Dong Qian Kun","slug":"wu-dong-qian-kun","coverUrl":"https://cdn.wuxiaworld.com/images/covers/wdqk.jpg?ver=f5d0b440e10f3857216dada4b1c0925593738f15","abbreviation":"WDQK","synopsis":"<p><strong>Our Sypnopsis</strong></p><p>The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them&hellip;</p><p>Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.</p><p>Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman&hellip;</p><p><br></p><p><strong>Official Sypnopsis</strong></p><p>修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 &nbsp;</p><p>&nbsp;武之极，破苍穹，动乾坤！</p><p>On the Journey of Cultivation,&nbsp;</p><p>One must steal Ying and Yang,&nbsp;</p><p>Sieze the Laws of Creation,&nbsp;</p><p>Reach for Nirvana,&nbsp;</p><p>Obtain Mastery over Life and Death,&nbsp;</p><p>and Power over Reincarnation.</p><p>At the peak of Martial Arts, break through the Heavens and shake the Universe!</p>","language":"Chinese","timeCreated":1446854400.0,"sneakPeek":false,"status":2,"chapterCount":1317,"tags":["Chinese","Completed"],"genres":["Action","Fantasy","Romance","Tragedy","Xuanhuan"]},{"id":18,"name":"Warlock of the Magus World","slug":"warlock-of-the-magus-world","coverUrl":"https://cdn.wuxiaworld.com/images/covers/wmw.jpg?ver=2839cf223fce0da2ff6da6ae32ab0c4e705eee1a","abbreviation":"WMW","synopsis":"<p>What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?</p><p>An awesome MC &mdash; that&rsquo;s what happens!</p><p>A scientist&rsquo;s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.</p><p><em>Face? Who needs that&hellip; Hmmm&hellip; that guy seems too powerful for me to take on now&hellip; I better keep a low profile for now.</em></p><p><em>You want me to help you? Sure&hellip; but what benefit can I get out of it? Nothing? Bye.</em></p><p><em>Hmmm&hellip; that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me&hellip;.. Nahhh. *kill*</em></p>","language":"Chinese","timeCreated":1470441600.0,"sneakPeek":false,"status":2,"chapterCount":1201,"tags":["Chinese","Completed"],"genres":["Alchemy","Fantasy","Mature","Political Intrigue"]},{"id":51,"name":"Upgrade Specialist in Another World","slug":"upgrade-specialist-in-another-world","coverUrl":"https://cdn.wuxiaworld.com/images/covers/usaw.jpg?ver=4071020d46f35a92870cd04289a80955651845fa","abbreviation":"USAW","synopsis":"<p>Just as a gamer found an overpowered skill book called &lsquo;Item Upgrade&rsquo; in the hottest virtual reality role-playing game on Earth, something happened to the game&rsquo;s system, causing his soul to leave his body and go to another dimension. Common sense dictates that he would be born anew then become the greatest overlord of this world by making use of his advanced knowledge. Not in this case! He was already dead. Only some fragments of his soul and that skill book managed to get into that dimension and merge with an ordinary common youngster called Bai Yunfei.</p><p>This was the enormous Tianhun continent, where humans could be said to have no limits. There was a group of humans here who could cultivate the power of their own souls then control their bodies, the natural elements and even other people&rsquo;s souls with that power! These special beings were called &mdash; soul cultivators. Come witness how the several fragments of the dead inter-dimensional traveler&rsquo;s soul and that skill book, which was not governed by the laws of this plane, were going to help Bai Yunfei become a legendary soul cultivator and craftsman!</p>","language":"Chinese","timeCreated":1452384000.0,"sneakPeek":false,"status":1,"chapterCount":1125,"tags":["Chinese","Ongoing"],"genres":["Action","Crafting","Fantasy","Xuanhuan"]},{"id":69,"name":"Trash of the Count's Family","slug":"trash-of-the-counts-family","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tcf.jpg?ver=45f6496cb859b136b1460db16bce805349480bca","abbreviation":"TCF","synopsis":"<p><br></p><p>Miraclerifle&#39;s synopsis: The MC of this series reminds me of Yoh Asakura from Shaman King, wanting to have a peaceful life but things getting in his way/having to achieve something to get there. This is a literary RPG fantasy where the MC is transported as a minor character in a novel, but ends up getting into situations that lead him to pretty much become the MC. It has a lot of interesting aspects with dragons, beast people, mermaids, superpowers and more! Come check it out if you want to see if the MC ever gets to live the slacker couch potato life that he wishes to have!</p><p><br></p><p>Special Pages</p><p><a href=\"https://www.wuxiaworld.com/page/trash-of-the-counts-family/character-poll-results-real\" rel=\"noopener noreferrer\" target=\"_blank\">Character Poll Results</a></p>","language":"Korean","timeCreated":1538092800.0,"sneakPeek":false,"status":1,"chapterCount":305,"tags":["Korean","Ongoing"],"genres":["Action","Alchemy","Comedy","Cooking","Fantasy","Kingdom Building","Political Intrigue","Superpowers"]},{"id":49,"name":"TranXending Vision","slug":"tranxending-vision","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tv.jpg?ver=fe94dd75a42c9f4cf8f5a7ccd128d3930834f44e","abbreviation":"TV","synopsis":"<p>Xia Lei, whose parents were no longer around, had to work hard to support himself and his sister. One day, he got into an accident at work which burnt his left eye. After he awoke in the hospital bed, he discovered that his eye was not blind &ndash; it gained abilities! Now, he is using these abilities to right wrongs and make a better life for himself and others. Will Xia Lei triumph over the corrupt and privileged with his newfound power?</p><p>I am destined to be the protagonist of this era!</p><p><em>Warning: Mature content</em></p>","language":"Chinese","timeCreated":1506816000.0,"sneakPeek":false,"status":1,"chapterCount":621,"tags":["Chinese","Ongoing"],"genres":["Action","Comedy","Fantasy","Modern Setting","Mystery","Romance","Superpowers"]},{"id":50,"name":"The Unrivaled Tang Sect","slug":"the-unrivaled-tang-sect","coverUrl":"https://cdn.wuxiaworld.com/images/covers/uts.png?ver=0a1aeba0131f4ab24a4e68a2e62c5bb8f2ca93d1","abbreviation":"UTS","synopsis":"<p>The legend of the continent, the battle that brought fame; the Sacred Phoenix Lady, the Windfire Meteor Godrealm saber-art; the pair that ascend and fuse, the golden sun and the blue moon, the fury of the crashing thunder. There is no magic, no battle qi, nor any martial arts in this land. However, there are martial spirits. Ten thousand years have passed since the founding of the Tang Sect on the Douluo continent, and it has declined. A new, proud generation of heaven&rsquo;s chosen has been born. Can the new generation of Shrek&rsquo;s Seven Devils rally the Tang Sect and once more compose the song of the Unrivaled Tang Sect?</p><p>A million-year-old spirit beast, a sacred deathgod that holds the sun, the moon, and the stars in his hands, and a brand new spirit tool system which caused the fall of the Tang sect. One miracle shall occur after another.Can the Tang Sect&rsquo;s hidden weapons rally the winds, and can the glory of the Tang Sect ascend once more? All of this will be continued in the second installment of Douluo Dalu&mdash;The Unrivaled Tang Sect!</p><hr><p><strong>Disclaimer: there are no major spoilers.</strong> However, the exception to this is the prologue. If you don&rsquo;t want any spoilers, you don&rsquo;t need to read the prologue, as it doesn&rsquo;t really affect the plot much.</p>","language":"Chinese","timeCreated":1488844800.0,"sneakPeek":false,"status":1,"chapterCount":1508,"tags":["Chinese","Ongoing"],"genres":[]},{"id":83,"name":"The Sword and The Shadow","slug":"the-sword-and-the-shadow","coverUrl":"https://cdn.wuxiaworld.com/images/covers/ts2.jpg?ver=ac830ab9e08b690a5fb637020f0a86ae30362241","abbreviation":"TS2","synopsis":"<div id=\"editdescription\"><p>Leguna. An orphan. His life changed dramatically the day the thieves&rsquo; guild happened to select him for training and development. He would go on to become lifelong friends with a loyal mercenary, the partner of a beautiful magus who was cold as ice, the savior of a mysterious disfigured dark-elf girl with a talent for the Breath, and the unlikely caregiver for a feisty young maiden. And yet, who would be with him to the very end?</p><p>In a twist of fate, the child who fought stray dogs for food emerged to be the most infamous assassin in the world. But the intricacies of power are not so easily grasped, and the price of protecting those that he loves is not as simple as he once thought&hellip;</p></div>","language":"Chinese","timeCreated":1564933481.1241539,"sneakPeek":true,"status":1,"chapterCount":518,"tags":["Chinese","Ongoing"],"genres":["Comedy","Fantasy"]},{"id":67,"name":"The Novel's Extra","slug":"the-novels-extra","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tne.jpg?ver=87c54513280923da143340b98c25166315a09911","abbreviation":"TNE","synopsis":"<p><br></p><p>Waking up, Kim Hajin finds himself in a familiar world but an unfamiliar body.&nbsp;</p><p>A world he created himself and a story he wrote, yet never finished.&nbsp;</p><p>He had become his novel&#39;s extra, a filler character with no importance to the story.</p><p>The only clue to escaping is to stay close to the main storyline.&nbsp;</p><p>However, he soon finds out the world isn&#39;t exactly identical to his creation.</p>","language":"Korean","timeCreated":1528329600.0,"sneakPeek":false,"status":1,"chapterCount":347,"tags":["Korean","Ongoing"],"genres":["Action","Fantasy","Modern Setting","Romance"]},{"id":64,"name":"The Great Ruler","slug":"the-great-ruler","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tgr.jpg?ver=d3e56010728a3dfd129a911cc9e63f886ea5c09d","abbreviation":"TGR","synopsis":"<p>The Great Thousand World. It is a place where numerous planes intersect, a place where many clans live and a place where a group of lords assemble. The Heavenly Sovereigns appear one by one from the Lower Planes and they will all display a legend that others would desire as they pursue the road of being a ruler in this boundless world.</p><p>In the Endless Fire Territory that the Flame Emperor controls, thousands of fire blazes through the heavens.</p><p>Inside the Martial Realm, the power of the Martial Ancestor frightens the heaven and the earth.</p><p>At the West Heaven Temple, the might of the Emperor of a Hundred Battles is absolute.</p><p>In the Northern Desolate Hill, a place filled with thousands of graves, the Immortal Owner rules the world.</p><p>A boy from the Northern Spiritual Realm comes out, riding on a Nine Netherworld Bird, as he charges into the brilliant and diverse world. Just who can rule over their destiny of their path on becoming a Great Ruler? In the Great Thousand World, many strive to become a Great Ruler.</p>","language":"Chinese","timeCreated":1437004800.0,"sneakPeek":false,"status":1,"chapterCount":1282,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Romance","Tragedy","Xuanhuan"]},{"id":48,"name":"The Grandmaster Strategist","slug":"the-grandmaster-strategist","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tgs.jpg?ver=a44e1c550ab609ed8ea976bccc5d11e05bdc75cf","abbreviation":"TGS","synopsis":"<p><br></p><p>This is an alternate history. &nbsp;Decades after the fall of the Eastern Jin Dynasty, the world is still in chaos, although there is hope for reunification.</p><p>Of poor background, Jiang Zhe, styled Suiyun, has finally, after ten years of hard work, passed the imperial examinations and become a scholar within Hanlin Academy. &nbsp;Unwittingly, he becomes involved in the succession dispute of the Great Yong Dynasty. &nbsp;He faces conspiracies and machinations, countless battles of strength and wits. &nbsp;Intending to avoid court politics, he ultimately has no choice but to become involved. &nbsp;With no alternative, Jiang Zhe can only follow the crowd, joining the chaotic political turmoil. &nbsp;In this conniving world, he uses his intelligence and knowledge to provide for himself and his companions a stable environment to survive.</p><p>Watch nations fall, great men rise, and supreme martial artists kneel before the quiet whispers of a frail, unassuming scholar.</p>","language":"Chinese","timeCreated":1480636800.0,"sneakPeek":false,"status":1,"chapterCount":191,"tags":["Chinese","Ongoing"],"genres":["Romance","Wuxia"]},{"id":62,"name":"The Godsfall Chronicles","slug":"the-godsfall-chronicles","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tgc.png?ver=3f2341cb0307b58d0bf5724326b5e4aca5fdc074","abbreviation":"TGC","synopsis":"<p><strong>RWX&rsquo;s English Synopsis:</strong> The nuclear holocaust which caused the collapse of the Old Times on Earth should have wiped out all human life on the planet. &nbsp;Yes, the gods set up their beautiful Elysiums to provide sanctuaries for their chosen, but by all rights everyone outside the elysian lands should&rsquo;ve perished long ago. &nbsp;Yet somehow, human life still managed to persist, even in the deadly, mutant-infested wastelands. &nbsp;Cloudhawk was a young scavenger who dreamed of being as free as the hawks in the skies, yet seemed destined to live out his life scrounging for scraps in the wasteland ruins. &nbsp;Fate, however, is ever-fickle. &nbsp;A chance meeting with a ragtag group of mercenaries changed the trajectory of his life, bringing him into a world with mutants and metahumans, demonhunters and godslayers, and even gods and demons. &nbsp;Cloudhawk would find his own place in a world that was far greater than he had imagined, find his own path between the zealous light of Sumeru and the whispering darkness of the Abyss&hellip; and one day, he would find that even gods may fall.</p><hr><p><strong>Official Chinese Synopsis:</strong>&nbsp;This is a world of nirvanic rebirth, a world of marvels and illusions, a world where faith is enduring and yet ruined. This is the story of a youth who seems ordinary, but who shoulders an earth-shaking secret and burden. He shall rise to prominence from his humble roots and walk a tightrope between life and death, and be lost in deciding between what is right and what is wrong. He seeks out the truth behind the destruction of Earth&rsquo;s civilizations, and shall experience unbelievable dangers as he grows. In the end, he shall discover the hidden secrets behind the ancient war between the gods and the demons, and shall play the lead role in this stunning and exciting story!</p>","language":"Chinese","timeCreated":1499558400.0,"sneakPeek":false,"status":1,"chapterCount":529,"tags":["Chinese","Ongoing"],"genres":[]},{"id":61,"name":"The Divine Elements","slug":"the-divine-elements","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tde.jpg?ver=da3305fa32629236b885e5f8f16a8bed5dc4ba82","abbreviation":"TDE","synopsis":"<p style=\"box-sizing: inherit; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><em style=\"box-sizing: inherit; font-style: italic;\">Anger.&nbsp;Pain. Desolation.</em></p><p style=\"box-sizing: inherit; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><em style=\"box-sizing: inherit; font-style: italic;\">An orphan boy tries to forge his own destiny in order to seek the strength to avenge the deaths of his family, as he shatters the chains of servitude bond to him.</em></p><p style=\"box-sizing: inherit; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><em style=\"box-sizing: inherit; font-style: italic;\">On his eighth birthday, Calron awakened to the weakest known power in the world: the element of lightning. However, unlike the normal golden lightning of other cultivators, Calron&rsquo;s lightning was an azure-blue color.</em></p><p style=\"box-sizing: inherit; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><em style=\"box-sizing: inherit; font-style: italic;\">Hiding his powers from the world, Calron embarks on a journey of ascending to Godhood and takes his first step into a world of friendship, revenge, and bloodshed.</em></p>","language":"English","timeCreated":1502064000.0,"sneakPeek":false,"status":2,"chapterCount":233,"tags":["Ongoing","Original"],"genres":[]},{"id":24,"name":"The Charm of Soul Pets","slug":"the-charm-of-soul-pets","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tcosp.jpg?ver=185d3b45f71605a62a0a3985b631fc8c8bcd3509","abbreviation":"TCoSP","synopsis":"<p>Many islands dotted the vast oceans of this world. However, some of these islands were a lot more sinister than the rest. These islands, known as Nightmare Islands, were true nightmares to all but the strongest and most fortunate. Children were kidnapped and thrown on these isolated islands by the Nightmare Palace. There, they were forced to sign soul pacts with evil soul pets: Nightmares. These devils slowly devoured the souls of their trainers to grow stronger. If the children did not cultivate fast enough, then their souls would be devoured whole, leaving only an empty husk behind.</p><p>Chu Mu, the protagonist, was an heir to the Chu Clan, but due to a plotted murder, he was thrown to the island, sentencing him to almost certain death. Dancing on the edge of life and death, he struggled to survive with a small Moonlight Fox he captured. When he finally escaped the devilish foremen on his island, he couldn&rsquo;t help but let a breath out. But little did he know, the experience was only a beginning to a fated journey with his little Moonlight Fox&hellip;</p><hr><p>Cloud birds that soar through the blue sky; Terrorblood wolves that roam the wastelands ruthlessly. Dream beasts that dart through the moonlight forests; Ghost kings that dwell on foggy cliffs. Ocean spirit beasts that haunt the depths of the boundless oceans; thousand-eyed treants that stand unyielding on precipitous peaks.Sword Beetles, Sunset Eagles, Ancient Wood Demons, Chaotic Thunder Sprites, &nbsp;Cursed Demon Fox: Ice&hellip; Plants, Beasts, Elementals, Undead, this is the eccentric, variegated, beautiful, and stunning world of soul pets!</p><p>Our protagonist, a soul pet trainer, had at first a young, mutated soul pet &ndash; a Moonlight Fox. In unending fights, it mutated into the stronger Evil Flamed Six-tailed Demon fox and the even higher leveled Queen Flamed Nine-tailed Firefox!Under the companionship of this soul pet, he walked on the path to become a king, catching precious and rare soul pets, and never ceasing his endeavor to becoming the very best!</p>","language":"Chinese","timeCreated":1472169600.0,"sneakPeek":false,"status":1,"chapterCount":925,"tags":["Chinese","Ongoing"],"genres":["Action"]},{"id":47,"name":"Terror Infinity","slug":"terror-infinity","coverUrl":"https://cdn.wuxiaworld.com/images/covers/ti.jpg?ver=e5ecf47b9f980682e456cb6e8d3ed53ca9cbb1c7","abbreviation":"TI","synopsis":"<p>&ldquo;Want to know the meaning of life? Want to live&hellip; a real life?&rdquo;&nbsp;</p><p>The world shall change when you click YES.&nbsp;</p><p>In God&rsquo;s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies.&nbsp;</p><p>Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God&rsquo;s dimension.&nbsp;</p><p>Who is the true enemy?</p>","language":"Chinese","timeCreated":1423094400.0,"sneakPeek":false,"status":2,"chapterCount":835,"tags":["Chinese","Completed"],"genres":["Action","Modern Setting","Superpowers"]},{"id":46,"name":"Talisman Emperor","slug":"talisman-emperor","coverUrl":"https://cdn.wuxiaworld.com/images/covers/te.jpg?ver=b7606e87470d1a068f416052cd5b216342f90f31","abbreviation":"TE","synopsis":"<p>Chen Xi was a jinx who radiated misfortune the way a torch radiated light, and everyone around him knew it. His entire clan was annihilated when he was young, and not too long after that his parents disappeared. His marriage contract? Poof. Torn to shreds and gone up in smoke before the eyes of everyone in the city, almost humiliating his grandfather to the point of suicide! Cultivation? No time for that, he had a family to take care of!</p><p>This is the story of Chen Xi, a youth forced to stop cultivating and instead craft talismans to pay for his younger brother&rsquo;s tuition&hellip; and who, in the process, would rise to become known by all as the Talisman Emperor!</p><hr><p>Crafting talismans.</p><p>Physique refinement.</p><p>Cultivating the supreme Dao of the sword.</p><p>Comprehending the profound meaning of the laws&hellip;..</p><p>In this world where primordial beings roam freely, Chen Xi relied on outstanding courage and wisdom, and heaven defying fortuitous encounters to eventually step onto the peak of the boundless Great Dao, and control everything under the heavens!</p>","language":"Chinese","timeCreated":1505001600.0,"sneakPeek":false,"status":1,"chapterCount":1346,"tags":["Chinese","Ongoing"],"genres":["Action","Cooking","Crafting","Fantasy","Mystery","Xuanhuan"]},{"id":45,"name":"Tales of Demons & Gods","slug":"tales-of-demons-and-gods","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tdg.jpg?ver=9ad2e575c0daf4585acaa59f2c4b4b5b289c6864","abbreviation":"【tdg】","synopsis":"<p>Killed by a Sage Emperor and reborn as his 13 year old self, Nie Li was given a second chance at life. A second chance to change everything, save his loved ones and his beloved city. He shall once again battle with the Sage Emperor to avenge his death. With the vast knowledge he accumulated in his previous life, he shall have a new starting point. Although he started as the weakest, without a doubt, he will climb the steps towards the strongest.</p><p>Cultivating the strongest cultivation technique, wielding the strongest demon spirits, he shall reach the pinnacle of Martial Arts. Enmities of the past will be settled in this new lifetime.</p><p>&ldquo;Since I&rsquo;m back, then in this lifetime, I shall become the King of Gods that dominates everything. Let everything else tremble beneath my feet!&rdquo;</p>","language":"Chinese","timeCreated":1436313600.0,"sneakPeek":false,"status":1,"chapterCount":479,"tags":["Chinese","Ongoing"],"genres":[]},{"id":74,"name":"Stop, Friendly Fire!","slug":"stop-friendly-fire","coverUrl":"https://cdn.wuxiaworld.com/images/covers/sff.jpg?ver=071937f5ef5b2d5c24cf1ae552850cd19f4b837d","abbreviation":"SFF","synopsis":"<p>The empire has turned into the land of the undead due to a spell gone wrong. God summoned heroes from countless worlds to purify the empire and plant new hope. Lee Shin Woo, an ordinary earthling, was also summoned. As an undead, that is.&nbsp;</p>","language":"Korean","timeCreated":1539734400.0,"sneakPeek":false,"status":1,"chapterCount":302,"tags":["Completed","Korean"],"genres":["Action","Comedy","Fantasy","Superpowers"]},{"id":17,"name":"Stellar Transformations","slug":"stellar-transformations","coverUrl":"https://cdn.wuxiaworld.com/images/covers/st.jpg?ver=301a29ac89cff465fde8840e05232e7be8779c10","abbreviation":"ST","synopsis":"<p>星辰变, aka Stellar Transformation, is a webnovel by popular Chinese Xianxia (fantasy/kung fu) writer I Eat Tomatoes （我吃西红柿）.</p>","language":"Chinese","timeCreated":-62135596800.0,"sneakPeek":false,"status":2,"chapterCount":311,"tags":["Chinese","Completed"],"genres":[]},{"id":44,"name":"Spirit Vessel","slug":"spirit-vessel","coverUrl":"https://cdn.wuxiaworld.com/images/covers/sv.jpg?ver=c4e63df2940317b1fe81fbcd595c9b6fb83264e7","abbreviation":"SV","synopsis":"<p>Spirit Vessel takes place in a mysterious world. There are cultivators rebelling against the heavens and elegant beauties with endless grace. There are peerless experts reincarnating into the world again, a world filled with formidable ancient beasts. Beneath the earth is the Yellow Springs while above the heavens is where many saintly palaces float&hellip; And then there are the seven spirit vessels&hellip;</p><p>Don&rsquo;t forget about our heroic MC with indomitable willpower &mdash; Feng Feiyun. This Demon Phoenix Emperor will take you through a wondrous story with many dramatic and gripping tales.</p><p><em>Even if I die to a poisonous rose, I would still choose love.</em></p>Bao:<p>A prodigal young master fused with a phoenix clan master. Shameless, impulsive, and weak against women in a world with the strongest female characters. How is he going to survive? A wuxia disguised as a xuanhuan.&nbsp;</p>","language":"Chinese","timeCreated":1464739200.0,"sneakPeek":false,"status":1,"chapterCount":578,"tags":["Chinese","Ongoing"],"genres":["Action","Comedy","Fantasy","Mature","Romance","Xuanhuan"]},{"id":43,"name":"Spirit Realm","slug":"spirit-realm","coverUrl":"https://cdn.wuxiaworld.com/images/covers/sr.jpg?ver=3901b9c9ff60f261a8c08ed427bf162aba42ba59","abbreviation":"SR","synopsis":"<p><strong>Official Synopsis:</strong> Thirty thousand years ago, the Heaven Fighting Race who called themselves &ldquo;Gods&rdquo; invaded Spirit Realm. Hundreds of races rose up in resistance, but ultimately suffered a crushing defeat. The human race was the first to concede, and the rest of the Hundred Races soon followed in succession.</p><p>During the subsequent ten thousand years, all of the races were enslaved by the Heaven Fighting Race. They were cruelly treated, and lived beneath the shadow of terror.</p><p>The Heaven Fighting Race&rsquo;s march of conquest did not stop there. With Spirit Realm as the starting point, they invaded other secret dimensions, and spread war to all corners of existence. After greatly exhausting their combat strength, they were finally defeated by the Hundred Races who took advantage of this opportunity. With no other choice, they fled to the starry skies outside the realm.</p><p>Thirty thousand years later, in an era where the Heaven Fighting Race has already faded to become ancient legend, an amnesiac youth possessing the Heaven Fighting Race&rsquo;s bloodline is being fostered in an insignificant household. Whilst struggling to live on, he silently awaits the day of the bloodline&rsquo;s awakening.</p>","language":"Chinese","timeCreated":1470096000.0,"sneakPeek":false,"status":1,"chapterCount":1551,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Mature","Mystery","Xuanhuan"]},{"id":42,"name":"Sovereign of the Three Realms","slug":"sovereign-of-the-three-realms","coverUrl":"https://cdn.wuxiaworld.com/images/covers/sotr.png?ver=e9929c727cefc03ea18d9c47d732151cfa3edfae","abbreviation":"SoTR","synopsis":"<p><strong>Synopsis:</strong> Jiang Chen, son of the Heavenly Emperor, unexpectedly reincarnated into the body of a despised young noble, thus embarking on the path of the underdog trouncing all comers. No one has the right to call himself a genius in front of Jiang Chen, as no one has a better understanding of the heavens than the son of the Heavenly Emperor. Genius? He who adheres to me shall ascend, those who oppose me can find solace in hell!</p><hr><p><strong>Custom TL synopsis:</strong> Sentenced to death because of farting in the first chapter. &rsquo;nuff said.</p><p><a href=\"https://twitter.com/etvofluff\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://cdn.wuxiaworld.com/uploads/etvolare/images/qv0dfxe0.ptf.jpg\" style=\"width: 617px;\" class=\"fr-fic fr-dib\"></a></p>","language":"Chinese","timeCreated":1447891200.0,"sneakPeek":false,"status":1,"chapterCount":1881,"tags":["Chinese","Ongoing"],"genres":["Comedy","Fantasy","Mystery","Xianxia"]},{"id":41,"name":"Skyfire Avenue","slug":"skyfire-avenue","coverUrl":"https://cdn.wuxiaworld.com/images/covers/sfl.jpg?ver=4859bf26950af73bd6adec8db2a18b9443866c5c","abbreviation":"SFL","synopsis":"<p>天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. &nbsp;This project is <strong>complete</strong>, having been finished by <a href=\"https://www.wuxiaworld.com/novel/the-godsfall-chronicles\">Xiao Lai</a>. </p>","language":"Chinese","timeCreated":1426723200.0,"sneakPeek":false,"status":2,"chapterCount":886,"tags":["Chinese","Completed"],"genres":[]},{"id":78,"name":"Sage Monarch","slug":"sage-monarch","coverUrl":"https://cdn.wuxiaworld.com/images/covers/sm.jpg?ver=dd076ba3257184a4729477a2f8445d7e1ff575d9","abbreviation":"SM","synopsis":"<p>Yang Qi is a skilled fighter, but also has the reputation of being hedonistic and impulsive. To impress a girl, he does something monumentally stupid, and ends up crippled, unable to practice martial arts or energy cultivation. Furthermore, his actions put his clan in danger of being exterminated. To top it all off, he gets struck by lightning. However, as it turns out, being struck by lightning isn&#39;t such a bad thing after all....</p>","language":"Chinese","timeCreated":1549128869.3892369,"sneakPeek":false,"status":1,"chapterCount":298,"tags":["Chinese","Editor's Choice","Ongoing"],"genres":["Action","Fantasy","Kingdom Building","Political Intrigue","Xuanhuan"]},{"id":40,"name":"Renegade Immortal","slug":"renegade-immortal","coverUrl":"https://cdn.wuxiaworld.com/images/covers/rge.jpg?ver=25163f94a5ef215e0ce22396691a5b01f5147d46","abbreviation":"RGE","synopsis":"<p>Renegade Immortal / Xian Ni (仙逆) &ndash; Wang Lin is a very smart boy with loving parents. Although he and his parents are shunned by the rest of their relatives, his parents have always held high hopes that he will one day become someone great. One day, Wang Lin suddenly gained the chance to walk the path of an immortal but found that he only had mediocre talent at best. Watch Wang Lin as he breaks through his lack of talent and walks the path towards becoming a real immortal!</p>","language":"Chinese","timeCreated":1445644800.0,"sneakPeek":false,"status":1,"chapterCount":1797,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Tragedy","Xianxia"]},{"id":81,"name":"Refining the Mountains and Rivers","slug":"refining-the-mountains-and-rivers","coverUrl":"https://cdn.wuxiaworld.com/images/covers/rmr.jpg?ver=462966c3c70bd9a9b62e2549b9ac4ecf78aa819a","abbreviation":"RMR","synopsis":"<p>A young man&#39;s life changes when he stumbles upon a little blue lamp. &nbsp;An immortal and demonic cultivating adventure. </p>","language":"Chinese","timeCreated":1561399269.9042878,"sneakPeek":true,"status":2,"chapterCount":22,"tags":[],"genres":[]},{"id":39,"name":"Rebirth of the Thief Who Roamed the World","slug":"rebirth-of-the-thief-who-roamed-the-world","coverUrl":"https://cdn.wuxiaworld.com/images/covers/rotwrtw.jpg?ver=97b8f80e05a4b42d29eb1363d19782bb8e6445b5","abbreviation":"RoTWRTW","synopsis":"<p>The world&rsquo;s largest VRMMO, Conviction, was almost like a second world for humanity. It had integrated itself into the real world&rsquo;s economy, with both corporations and individuals seeking their fortunes through the game. In this game,&nbsp;Nie Yan prided himself in his Level 180 Thief. He could barely be considered among the top experts in the game. Though, that was the only thing he could take pride in. He was penniless and unable to advance in life; a situation he was forced into by the enemy of his father. If it weren&rsquo;t for the little money he made by selling off items in Conviction, he would&rsquo;ve barely been able to eat.&nbsp;In the end, he&nbsp;chose to settle his matters once and for all. He assassinated his father&rsquo;s enemy. He lay dying shortly after being shot in the pursuit. However, that wasn&rsquo;t the end of his story. Instead, he awoke moments later to find that he had reincarnated into his past-self. Armed with his experience&nbsp;and knowledge of future events, he sets out to live his life anew.</p>","language":"Chinese","timeCreated":1457827200.0,"sneakPeek":false,"status":1,"chapterCount":739,"tags":["Chinese","Ongoing"],"genres":["Action","Crafting","Fantasy","Modern Setting","Romance","Virtual Reality"]},{"id":77,"name":"Physician’s Odyssey","slug":"physicians-odyssey","coverUrl":"https://cdn.wuxiaworld.com/images/covers/po.jpg?ver=5e3c541284e7fcb637dcae2c13fc97242483ea26","abbreviation":"PO","synopsis":"<p>An urban fiction.&nbsp;</p><p>Mediocre is a common characteristic of the majority. But when someone outstanding appears beside you, your life will change because of him. That&rsquo;s the principle of &lsquo;who you mix around with is a reflection of yourself.&rsquo; The doctor in charge of the Three Flavour Hall will change everything. You can raise a campus belle, a CEO beauty&hellip;&nbsp;</p><p>Somewhat vulgar, a little cold yet sexy, admiring young married woman and nurturing lolita. Moralists, please be warned.</p>","language":"Chinese","timeCreated":1547300156.0040019,"sneakPeek":false,"status":1,"chapterCount":62,"tags":["Chinese","Editor's Choice","Ongoing"],"genres":["Action","Comedy","Modern Setting","Political Intrigue","Romance","Wuxia"]},{"id":38,"name":"Perfect World","slug":"perfect-world","coverUrl":"https://cdn.wuxiaworld.com/images/covers/pw.jpg?ver=9aa60904395db73b02c029213d04de2abc71133f","abbreviation":"PW","synopsis":"<p><strong>Synopsis</strong></p><p>A speck of dust can fill an ocean. A blade of grass can destroy the sun, moon, and the stars. A flick of a finger can turn the world upside down.</p><p>Groups of heroes rise, and innumerable&nbsp;clans stand together. Various saints fight for power as the entire world falls into chaos. I ask the boundless Mother Earth: Who decides the ups and downs?</p><p>A young man walks out of the barren wilderness, and everything starts from there&hellip;</p>","language":"Chinese","timeCreated":1437004800.0,"sneakPeek":false,"status":1,"chapterCount":1423,"tags":["Chinese","Ongoing"],"genres":["Action","Comedy","Fantasy","Tragedy","Xuanhuan"]},{"id":56,"name":"Overgeared","slug":"overgeared","coverUrl":"https://cdn.wuxiaworld.com/images/covers/og.jpg?ver=c3ffea743a4713d684f3679072444e01242d6964","abbreviation":"OG","synopsis":"<p>Shin Youngwoo has had an unfortunate life and is now stuck carrying bricks on construction sites. He even had to do labor in the VR game, Satisfy!</p><p>However, luck would soon enter his hapless life. His character, &lsquo;Grid&rsquo;, would discover the Northern End Cave for a quest, and in that place, he would find &lsquo;Pagma&rsquo;s Rare Book&rsquo; and become a legendary class player&hellip;</p>","language":"Korean","timeCreated":1508112000.0,"sneakPeek":false,"status":1,"chapterCount":1066,"tags":["Korean","Ongoing"],"genres":["Crafting","Virtual Reality"]},{"id":76,"name":"Nine Star Hegemon Body Art","slug":"nine-star-hegemon","coverUrl":"https://cdn.wuxiaworld.com/images/covers/nshba.jpg?ver=8a994a1b9d01acd28f5024da5c6be6a8e29ee7a3","abbreviation":"NSHBA","synopsis":"<p style=\"box-sizing: border-box; margin-right: 0px; margin-left: 0px; color: rgb(34, 34, 34); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><strong>Translator Blurb:&nbsp;</strong>Long Chen, a crippled youth who cannot cultivate, is constantly targeted and bullied by his fellow noble heirs. After a particularly vicious beating, he wakes up and realizes a Pill God&rsquo;s soul has somehow merged with him, giving him some additional memories. Within those memories is the mysterious Nine Star Hegemon Body Art, a cultivation technique that even he can train in, but whose secrets and origin are still a mystery to him. Relying on his improved instincts as he finally begins to cultivate, he realizes a huge conspiracy is underfoot within the Phoenix Cry Empire; a conspiracy involving his father, members of the imperial family, and even the Emperor himself.</p><p style=\"box-sizing: border-box; margin-right: 0px; margin-left: 0px; color: rgb(34, 34, 34); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\">In order to solve the mysteries around him, he must rely on his new alchemy techniques and the powerful but baffling Nine Star Hegemon Body Art. Countless enemies block him as he attempts to climb to the peak of the cultivation world.</p><p style=\"box-sizing: border-box; margin-right: 0px; margin-left: 0px; color: rgb(34, 34, 34); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\">Fate destined him to be only a chess piece, but he would not bow to the will of the Heavens.</p>","language":"Chinese","timeCreated":1544376528.494643,"sneakPeek":false,"status":1,"chapterCount":672,"tags":["Chinese","Ongoing"],"genres":["Action","Alchemy","Comedy","Crafting","Fantasy","Xianxia","Xuanhuan"]},{"id":37,"name":"Monarch of Evernight","slug":"monarch-of-evernight","coverUrl":"https://cdn.wuxiaworld.com/images/covers/moe.png?ver=86887879bcfdb7694e22407a453eeaa52c5d4c34","abbreviation":"MoE","synopsis":"<p>Zongheng Synopsis: Qianye rose from hardship but was felled by betrayal. From then, one man, one gun; he tread the path between Evernight and Daybreak and became a legend. Even if Evernight was destined to be his fate, he still intends to become the ruler who dictates.</p>","language":"Chinese","timeCreated":1493769600.0,"sneakPeek":false,"status":1,"chapterCount":713,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Kingdom Building","Political Intrigue","Romance","Wuxia","Xuanhuan"]},{"id":36,"name":"Martial World","slug":"martial-world","coverUrl":"https://cdn.wuxiaworld.com/images/covers/mw.png?ver=73ab294216541a1bb643fd644e7ad16975c2a9ff","abbreviation":"MW","synopsis":"<p>In the Divine Realm, countless legends fought over a mysterious cube. After the battle it disappeared into the void. A young man stumbles upon this mystery object, opening a whole new world to him. His name is Lin Ming, and this is his road of martial arts.</p>","language":"Chinese","timeCreated":1455667200.0,"sneakPeek":false,"status":2,"chapterCount":2276,"tags":["Chinese","Completed"],"genres":["Action","Alchemy","Cooking","Fantasy","Mystery","Romance","Tragedy","Xuanhuan"]},{"id":35,"name":"Martial God Asura","slug":"martial-god-asura","coverUrl":"https://cdn.wuxiaworld.com/images/covers/mga.jpg?ver=39e11140d3b24d8646736032f6298c34f0cc8ba5","abbreviation":"MGA","synopsis":"<p>Regarding potential&mdash;even if you are not considered a genius, you can still learn Mysterious Techniques and martial skills. Anyone can be enlightened without a master.</p><p>Regarding&nbsp;strength&mdash;despite having a myriad of artifacts, you may not defeat my army of World Spirits.</p><p>Who am I? All of the world&rsquo;s living perceives me as Asura, but I was ignorant to such a thing. I thus ascend to be the Martial God as Asura.</p>","language":"Chinese","timeCreated":1428883200.0,"sneakPeek":false,"status":1,"chapterCount":3607,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Mature","Xuanhuan"]},{"id":34,"name":"Lord of All Realms","slug":"lord-of-all-realms","coverUrl":"https://cdn.wuxiaworld.com/images/covers/loar.jpg?ver=9a9e706461dce6d8e0ccb1d4ec6cac8268119a0d","abbreviation":"LOAR","synopsis":"<p>In ancient times, there existed giant spirits capable of supporting the heavens. With bodies as enormous as stars, they soared across the universe. Great clan leaders with mysterious blood running through their veins shattered the void and created new worlds. Ancient Qi Warriors crossed a river of stars to enlighten numerous mortal beings. For unknown reasons, an era silently came to an end, all realms were separated, ancient giant spirits disappeared one after another. Thousands of years later, young Nie Tian managed to travel back into ancient times with the help of a drop of blood&hellip;</p>","language":"Chinese","timeCreated":1500422400.0,"sneakPeek":false,"status":1,"chapterCount":984,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Kingdom Building","Political Intrigue","Romance","Xianxia","Xuanhuan"]},{"id":33,"name":"Legend of the Dragon King","slug":"legend-of-the-dragon-king","coverUrl":"https://cdn.wuxiaworld.com/images/covers/ldk.jpg?ver=4f9c212f97eaaa0e56503ee909bea0d631e79fe1","abbreviation":"ldk","synopsis":"<p><strong><u>Synopsis:</u></strong></p><p dir=\"ltr\"><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">The Age of Gods has long since ended, their voices no longer heard on the continent of Douluo. Humanity, standing on the shoulders of legends from its history, advanced soul technology to inconceivable heights. The humans of Douluo invented weapons of mass destruction, mechanized armor, and living metals. With these advancements, they went on to conquer the oceans and discovered two new continents. To fuel these new technologies, humanity hunted the soul beasts to the very brink of extinction.&nbsp;</span></p><p dir=\"ltr\"><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Once the dominant force of Douluo, the few surviving soul beasts now hide in the darkest recesses of their last sanctuary. The weakest have all been hunted, leaving only the strongest to scheme in the heart of the forest. The soul beasts, not willing to fade away, plot an uprising for their survival. In the midst of this, a god from a long forgotten era awakens in the depths of the Great Star Dou Forest to seek vengeance for the soul beasts.&nbsp;</span></p><p dir=\"ltr\"><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">As darkness encroaches from the abyss, hope is found in a young boy who holds a power beyond divinity within himself&mdash;Tang Wulin! Hope for both humanity and the soul beasts, as the bridge between the two. He finds his way into the fabled halls of Shrek Academy, where he learns to wield his prodigious powers, makes friends and finds allies, eventually rising to become a towering leader.&nbsp;</span></p><p dir=\"ltr\"><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">As he learns to harness his strength, danger lurks within the shadows as the various factions of humanity maneuver and plot to usurp Shrek Academy. Tang Wulin discovers the threat to the only world he knows as he sinks deeper into the intrigue. Meanwhile, camouflaged by the chaos and unbeknownst to the humans, the soul beasts&rsquo; plot continues to steadily advance.</span></p><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">To defend what he loves and reclaim what was lost, Tang Wulin must seek out the legacies of legends past and unlock the full might of the Golden Dragon King!</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">\f</span></p>","language":"Chinese","timeCreated":1452816000.0,"sneakPeek":false,"status":1,"chapterCount":595,"tags":["Chinese","Ongoing"],"genres":["Action","Comedy","Crafting","Fantasy","Modern Setting","Mystery","Political Intrigue","Romance","Superpowers","Virtual Reality","Xuanhuan"]},{"id":32,"name":"Invincible","slug":"invincible","coverUrl":"https://cdn.wuxiaworld.com/images/covers/inv.jpg?ver=16ff496112e95f95534d7094dbae37fa777bb679","abbreviation":"Inv","synopsis":"<p>The strong are lonesome. Overcoming the loneliness pushes you to stand invincible at the top.</p><p>Pro-disciple of the Shaolin Temple on earth, Huang Xiaolong was reborn into a Martial Spirit world, carrying Hua Xia&rsquo;s secret knowledge, the Body Metamorphose Scripture.</p><p>In a Martial Spirit world, only those with Martial Spirit are able to train in battle qi and become a warrior. Huang Xiaolong born with a heaven-defying rare Martial Spirit was mistakenly taken for common variant Martial Spirit during the awakening ceremony conducted by the tribe and thus sidelined.</p><p>However, Huang Xiaolong with his common &ldquo;variant&rdquo; Martial Spirit again, and again displayed unnatural talent, defeating geniuses, shocking the clan and the entire Martial Spirit World.</p>","language":"Chinese","timeCreated":1476057600.0,"sneakPeek":false,"status":1,"chapterCount":1142,"tags":["Chinese","Ongoing"],"genres":["Action","Alchemy","Mature","Romance","Xuanhuan"]},{"id":31,"name":"Imperial God Emperor","slug":"imperial-god-emperor","coverUrl":"https://cdn.wuxiaworld.com/images/covers/ige.jpg?ver=0123ea4be8cb6dfc1494c3da16c89e26c2178669","abbreviation":"IGE","synopsis":"<p>Ye Qingyu, since the death of his parents four years ago, has been laughed at by the entire Deer city. Little does people know, he has just been biding his time for the entire four years. With the White Deer academy selection just around the corner, can he shut the mouths of all those who have laughed at him? Join Ye Qingyu in his journey to solve the mystery behind his family death and to reclaim the Ye family property!</p>","language":"Chinese","timeCreated":1448323200.0,"sneakPeek":false,"status":1,"chapterCount":1096,"tags":["Chinese","Ongoing"],"genres":[]},{"id":12,"name":"I Shall Seal the Heavens","slug":"i-shall-seal-the-heavens","coverUrl":"https://cdn.wuxiaworld.com/images/covers/issth.jpg?ver=2962ed3c79be0e1644ed376f7bcee8b5eac1d24b","abbreviation":"ISSTH","synopsis":"<p>I Shall Seal the Heavens is the story of the young scholar Meng Hao, who gets forcibly recruited into a sect of immortal cultivators. In the cultivation world, the strong prey on the weak, and the law of the jungle prevails. Meng Hao must adapt to survive. Filled with both comedy and drama, I Shall Seal the Heavens remains one of the most beloved xianxia stories ever translated. What does it mean to &ldquo;Seal the Heavens?&rdquo; This is a secret that you will have to uncover along with Meng Hao!</p>","language":"Chinese","timeCreated":1431907200.0,"sneakPeek":false,"status":2,"chapterCount":1620,"tags":["Chinese","Completed"],"genres":["Action","Alchemy","Comedy","Romance","Tragedy","Xianxia"]},{"id":54,"name":"I Reincarnated For Nothing","slug":"i-reincarnated-for-nothing","coverUrl":"https://cdn.wuxiaworld.com/images/covers/irfn.jpg?ver=cc62448bcb3ddd54647172f9d2c08208163d6352","abbreviation":"IRFN","synopsis":"<p style=\"box-sizing: inherit; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><strong style=\"box-sizing: inherit; font-weight: bold;\">Synopsis:&nbsp;</strong>&ldquo;My life as a demon&hellip; No. My life as human is really&hellip;&rdquo;</p><p style=\"box-sizing: inherit; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\">Artpe was supposed to live a charmed life as the 4th strongest in the Demon King&rsquo;s Army. However, his life was cut short by the hero&rsquo;s blade.With his previous life&rsquo;s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!</p>","language":"Korean","timeCreated":1510444800.0,"sneakPeek":false,"status":2,"chapterCount":204,"tags":["Completed","Korean"],"genres":[]},{"id":11,"name":"Horizon, Bright Moon, Sabre","slug":"tymyd","coverUrl":"https://cdn.wuxiaworld.com/images/covers/tymyd.jpg?ver=66dd22e2481779559132ef39f76132273cff182b","abbreviation":"TYMYD","synopsis":"<p>Fu Hongxue was a cripple, born with a lame leg and subject to epileptic seizures. &nbsp;He was also one of the most powerful, legendary figures of the martial arts world, with a dull black saber that was second to none. &nbsp;His fame made him a frequent target of challengers, but whenever his saber left its sheath, only corpses would remain in its wake. &nbsp;One day, however, Fu Hongxue rescued someone whom he should have killed&hellip;and in doing so, set of a chain of events and a conspiracy that would rock the world.</p>","language":"Chinese","timeCreated":-62135596800.0,"sneakPeek":false,"status":2,"chapterCount":25,"tags":["Chinese","Completed"],"genres":[]},{"id":10,"name":"Heroes Shed No Tears","slug":"heros-shed-no-tears","coverUrl":"https://cdn.wuxiaworld.com/images/covers/hsnt.jpg?ver=b97a800d7b470e21f39f835cd02bae9d0452109a","abbreviation":"HSNT","synopsis":"<p>Gao Jianfei: A naive martial arts genius, exploring the martial arts world for the first time in his life.</p><p>Zhu Meng: A man&#39;s man who lives by the sword, but who is more passionate and emotional than he realizes.</p><p>Sima Chaochun: The most famous martial artist in the world. Completely and utterly righteous. Or is he?</p><p>Zhuo Donglai: The brains behind Sima Chaochun&#39;s brawn, who always has a trick up his sleeve.</p><p>And the most fearsome weapon under heaven.</p><p>Heroes Shed No Tears is a tale of friendship and love, of loyalty and betrayal. Secrets upon secrets will be revealed; pay close attention, and you might be able to unravel the mystery before the characters do!</p>","language":"Chinese","timeCreated":-62135596800.0,"sneakPeek":false,"status":2,"chapterCount":19,"tags":["Chinese","Completed"],"genres":["Action","Mystery","Romance","Tragedy","Wuxia"]},{"id":30,"name":"Heavenly Jewel Change","slug":"heavenly-jewel-change","coverUrl":"https://cdn.wuxiaworld.com/images/covers/hjc.jpg?ver=f83790a5f2ff64bb6524c2cfd207845ba1d25ac6","abbreviation":"HJC","synopsis":"<p><em>[Zen&rsquo;s Synopsis]</em></p><p>In a world where power means everything, and the strong trample the weak; there was a boy born from a Heavenly Jewel Master. Born in a small country which had to struggle to survive, the boy was expected to do great things. Alas he turned out to have blocked meridians and was unable to cultivate, ending up the trash of society. His father&rsquo;s tarnished pride&hellip; his fiance&eacute;&rsquo;s ultimate dishonour&hellip;</p><p>Being almost accidentally killed and left for the dead, heaven finally smiles upon him as a miracle descends, awakening his potential as a Heavenly Jewel Master. Or&hellip; is it truly a gift?</p><p>Join our dear rascally and shameless MC Zhou Weiqing in his exploits to reach the peak of the cultivation world, form an army, protect those he loves, and improve his country!</p><p>An all new world, an all new power system, unique weaponry &amp; MC! Come join me in laughing and crying together with this new masterpiece from Tang Jia San Shao!</p><hr><p><em>[Translated Synopsis]</em></p><p>Every human has their Personal Jewel of power, when awakened it can either be an Elemental Jewel or Physical Jewel. They circle the right and left wrists like bracelets of power.</p><p>Heavenly Jewels are like the twins born, meaning when both Elemental and Physical Jewels are Awakened for the same person, the pair is known as Heavenly Jewels.</p><p>Those who have the Physical Jewels are known as Physical Jewel Masters, those with Elemental Jewels are Elemental Jewel Masters, and those who train with Heavenly Jewels are naturally called Heavenly Jewel Masters.</p><p>Heavenly Jewel Masters have a highest level of 12 pairs of jewels, as such their training progress is known as Heavenly Jewels 12 Changes.</p><p>Our MC here is an archer who has such a pair of Heavenly Jewels.</p>","language":"Chinese","timeCreated":1438473600.0,"sneakPeek":false,"status":2,"chapterCount":903,"tags":["Chinese","Completed"],"genres":[]},{"id":80,"name":"Heaven's Devourer","slug":"heavens-devourer","coverUrl":"https://cdn.wuxiaworld.com/images/covers/hd.jpg?ver=74da410ed2419079ded044b9bd78b7ca0c5325fc","abbreviation":"HD","synopsis":"<p><strong>Author&#39;s Synopsis:</strong></p><p>Heaven&#39;s rules and edicts will be written by me,</p><p>Thousands of ghosts and gods will bow before me.</p><p>In the hearts of all mortals,</p><p>I am the supreme emperor.</p><p>Before the eyes of Buddha,</p><p>I am the demon of this world.</p>","language":"Chinese","timeCreated":1556981444.0588529,"sneakPeek":false,"status":1,"chapterCount":150,"tags":["Chinese","Editor's Choice","Ongoing"],"genres":["Action","Fantasy","Tragedy","Xianxia"]},{"id":29,"name":"Gate of Revelation","slug":"gate-of-revelation","coverUrl":"https://cdn.wuxiaworld.com/images/covers/gor.jpg?ver=3b252052665c7bbe44c9fe61a56e23642cbf15be","abbreviation":"GoR","synopsis":"<p>After an unexpected incident, Chen Xiaolian, an ordinary high school student, came to discover that the world he lived in is nothing more than a program. That he and those around him exist as NPCs, serving only as a source of entertainment for others. That every decision he had ever made was simply the effect of a predetermined script.</p><p>Now, Chen Xiaolian must adapt, gather allies to fight and survive, and uncover the truth of this world.</p><hr><p>Life: In life, we attend school, find love, work, buy a house, pay our housing loans, insert weird faces in WeChat, watch movies&hellip; do any of you find anything amiss? One day, a group of strange people entered this world, equipped in strange clothing and possessing extraordinary powers, cold-blooded killers! They call themselves [Players].</p><p>Wait! Wait! You people want to kill me? You say I am NPC (Non Playable Character)? Stop joking around! You crazy bastards! I will fight you to the death! I will survive!</p><p>NPCs beating up Players! Original residents beating up Transmigrants!</p><p>My world, my rules! What makes you think you bastards can come over and boss us around?</p><p>Threading the path of the strongest saviour in history, one destined to be filled with excitement!</p><p>&hellip;</p><p>Chen Xiaolian: From today onward, an organization whose sole purpose is to oppose those bastards is established! Our guild shall be named&hellip; Jokesters Alliance![1]</p><p>Guild Member: Leader, this name, if we are to say it out, I fear we will be beaten up&hellip;</p>","language":"Chinese","timeCreated":1457913600.0,"sneakPeek":false,"status":1,"chapterCount":795,"tags":["Chinese","Ongoing"],"genres":["Action","Comedy","Fantasy","Modern Setting","Mystery","Superpowers","Xuanhuan"]},{"id":28,"name":"Emperor’s Domination","slug":"emperors-domination","coverUrl":"https://cdn.wuxiaworld.com/images/covers/emperor.jpg?ver=7e8c53aa1ebfa5f032ca14bde070fb48f142e173","abbreviation":"emperor","synopsis":"<p><strong>Bao&rsquo;s Synopsis:</strong> A boy that was imprisoned for millions of years had regained his mortal body. He became a disciple of the declining Cleansing Incense Ancient Sect where its patriarch used to be his disciple. Now, he will bring this sect back to its former glory.</p><p>This is his journey to reach the apex and take revenge on those who had imprisoned him.</p><p>This is his story of meeting old friends and making new companions.</p><p>This is his path of traversing the Nine Worlds and becoming the next ruler of the Heavens.</p><hr><p><strong>Qidian&rsquo;s Synopsis:</strong> Ten million years ago, Li Qiye planted a simple water bamboo into the ground.Eight million&nbsp;years ago, Li Qiye had a koi fish pet.Five million&nbsp;years ago, Li Qiye cared for a little girl....In the present day, Li Qiye woke up from his slumber; the water bamboo reached the apex of cultivation; the koi fish became a Golden Dragon; the little girl became the Nine Worlds&rsquo; Immortal Empress.</p><p>This is a tale regarding an immortal human who was the teacher of the Demon Saint, Heavenly Beast, and Immortal Empress.</p>","language":"Chinese","timeCreated":1464393600.0,"sneakPeek":false,"status":1,"chapterCount":2369,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Xuanhuan"]},{"id":70,"name":"Dragon Prince Yuan","slug":"dragon-prince-yuan","coverUrl":"https://cdn.wuxiaworld.com/images/covers/yz.jpg?ver=1f028687df8808196097d9f33ec652c09580280a","abbreviation":"YZ","synopsis":"<p><br></p><p>Destiny stolen at birth, the prince of the once mighty Great Zhou Empire, Zhou Yuan, has been plagued all his life by a fatal poison, forced to suffer powerlessly until one day when fate draws him into a mysterious domain where he meets a beautiful girl in green, a bizarre dog-like creature and an unfathomable old man in black.</p><p>Join Zhou Yuan as he is thrust into the whirlpool of destiny while he seeks the pinnacle of cultivation.</p><p><br></p><p>Yeow&#39;s comments: Potato (the author) really has a way certain arcs that make you can&#39;t stop gushing on and on about them for hours. It&#39;s one of the reasons why I enjoy his work so if you ever want to ramble on endlessly into the night with excitement, bring a friend along and join me as we venture to discover such yet uncovered gems.</p><p>(My personal highlights for WDQK and BTTH were the Yimo City arc and the alchemist competition arc respectively :P)</p>","language":"Chinese","timeCreated":-62135596800.0,"sneakPeek":false,"status":1,"chapterCount":169,"tags":["Chinese","Editor's Choice","Ongoing"],"genres":["Action","Comedy","Fantasy","Romance","Tragedy","Xuanhuan"]},{"id":53,"name":"Dragon Maken War","slug":"dragon-maken-war","coverUrl":"https://cdn.wuxiaworld.com/images/covers/dmw.jpg?ver=8a6352e72a24c0e90eafdc9ab97e0dcf9e335e83","abbreviation":"DMW","synopsis":"<p><strong>Synopsis:</strong>&nbsp;220 years ago, in the legendary Dragon Demon War, Hero Azell ended the war by killing the evil Dragon Demon race&rsquo;s King Atein. He was able to save the population, but as a consequence, he was cursed. While he was dying, the high magician suggest a gamble that might save his life. &lsquo;The Dragon&rsquo;s hibernation is the only key to saving your life.&rsquo; Instead of a human&rsquo;s sleep, he slept the sleep of the dragons and he was able to overcome the curse. Now he is realizing that he has slept way longer than a human&rsquo;s life span.</p>","language":"Korean","timeCreated":1446508800.0,"sneakPeek":false,"status":1,"chapterCount":257,"tags":["Korean","Ongoing"],"genres":[]},{"id":8,"name":"Dragon King With Seven Stars","slug":"dragon-king-with-seven-stars","coverUrl":"https://cdn.wuxiaworld.com/images/covers/dkss.jpg?ver=fe7becfcf631e1753b96cb172e160fcc05b80913","abbreviation":"DKSS","synopsis":"<p>Upon the death of multi-millionaire playboy Sun Jicheng, Jinan city suddenly becomes the center of a maelstrom of Jianghu intrigue. Once again, the mysterious death and/or disappearance of some of the most powerful and famous martial artists in recent years, such as the &ldquo;End the Heavens, Destroy the Earth&rdquo; crime-fighting duo Gao Tianjue and Guo Mie, and the master thief &ldquo;Laughing General&rdquo; Li, come to the spotlight. Smack dab in the middle of all the plotting and fighting is Ingot, a scrappy beggar who is far more than what he seems. Translated by Deathblade.</p>","language":"Chinese","timeCreated":1426636800.0,"sneakPeek":false,"status":2,"chapterCount":26,"tags":["Chinese","Completed"],"genres":["Action","Mystery","Wuxia"]},{"id":84,"name":"Divine Throne of Primordial Blood","slug":"divine-throne-of-primordial-blood","coverUrl":"https://cdn.wuxiaworld.com/images/covers/dtpb.jpg?ver=3fe7740967bd543d9288fe89a310821fa48eb953","abbreviation":"DTPB","synopsis":"<p><span style=\"color: rgb(92, 97, 102); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial; float: none; display: inline !important;\">Su Chen lost his sight in an unfortunate, unanticipated encounter. He was unwilling to give up despite suffering one of the most tragic fates possible in the human realm and fought on. Su Chen wants to use his own efforts to create a completely new destiny, both for himself and for mankind!</span></p>","language":"Chinese","timeCreated":1564933761.2176878,"sneakPeek":true,"status":1,"chapterCount":730,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Xuanhuan"]},{"id":27,"name":"Desolate Era","slug":"desolate-era","coverUrl":"https://cdn.wuxiaworld.com/images/covers/de.jpg?ver=6a8b21616e397749f1a334a49aafe82e09ef2db9","abbreviation":"DE","synopsis":"<p>Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn&rsquo;t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning&rsquo;s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater&hellip;and yet also smaller&hellip;than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.</p>","language":"Chinese","timeCreated":1446249600.0,"sneakPeek":false,"status":2,"chapterCount":1451,"tags":["Chinese","Completed"],"genres":[]},{"id":26,"name":"Demon Hunter","slug":"demon-hunter","coverUrl":"https://cdn.wuxiaworld.com/images/covers/dh.jpg?ver=bd8676637293541fd5c634eb7c811a46fb44a6ed","abbreviation":"DH","synopsis":"<p>---</p><p>Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.</p><p>Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.</p><p><span style=\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline;\">The left leads to hell, the right, also leads to hell.</span></p>","language":"Chinese","timeCreated":1510876800.0,"sneakPeek":false,"status":1,"chapterCount":1052,"tags":["Chinese","Ongoing"],"genres":[]},{"id":73,"name":"Coiling Dragon","slug":"coiling-dragon-preview","coverUrl":"https://cdn.wuxiaworld.com/images/covers/cdp.jpg?ver=bf51b81950352283e0e80d19aa4f97bc73fc2c54","abbreviation":"CDP","synopsis":"<p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial; float: none; display: inline !important;\">盘龙, aka Panlong, aka Coiling Dragon, is a webnovel by popular Chinese Xianxia (fantasy/kung fu) writer I Eat Tomatoes （我吃西红柿）. This novel has been fully translated by RWX. There are a total of 21 books spanning 800+ chapters, so sit back, buckle your seat belts, and get ready for one long ride!</span></p><p>Empires rise and fall on the Yulan Continent. Saints, immortal beings of unimaginable power, battle using spells and swords, leaving swathes of destruction in their wake. Magical beasts rule the mountains, where the brave &ndash; or the foolish &ndash; go to test their strength. Even the mighty can fall, feasted on by those stronger. The strong live like royalty; the weak strive to survive another day.</p><p>This is the world which Linley is born into. Raised in the small town of Wushan, Linley is a scion of the Baruch clan, the clan of the once-legendary Dragonblood Warriors. Their fame once shook the world, but the clan is now so decrepit that even the heirlooms of the clan have been sold off. Tasked with reclaiming the lost glory of his clan, Linley will go through countless trials and tribulations, making powerful friends but also deadly enemies.</p><p>Come witness a new legend in the making. The legend of Linley Baruch.</p>","language":"Chinese","timeCreated":-62135596800.0,"sneakPeek":false,"status":2,"chapterCount":3,"tags":["Chinese","Completed"],"genres":[]},{"id":25,"name":"City of Sin","slug":"city-of-sin","coverUrl":"https://cdn.wuxiaworld.com/images/covers/cos.jpg?ver=879444383470d2df1728d2ee1ab3f4f5f9ff85ae","abbreviation":"CoS","synopsis":"<p><em>Every drop of this family bloodline is stained with sin. They are the embodiment of contradiction; calm yet maniacal, with great memories yet often forgetful. They pledge themselves to their dreams yet often compromise, are angels that are also devils&hellip; It&rsquo;s why I hate them.</em></p><p><em>And also love them.</em></p><p>The only hope of his family, a youth with the blood of elves and demons walks on a battleground of annihilation and rebirth. He wills his way through boiling lava and icy depths, making a killing on this field of despair to strike down the lofty figure in his sight. One day he&rsquo;ll grasp his blade tightly and survey his surroundings, only to find no more enemies to kill.</p>","language":"Chinese","timeCreated":1514246400.0,"sneakPeek":false,"status":1,"chapterCount":1030,"tags":["Chinese","Ongoing"],"genres":["Action","Fantasy","Kingdom Building","Mature","Tragedy"]},{"id":4,"name":"Child of Light","slug":"child-of-light","coverUrl":"https://cdn.wuxiaworld.com/images/covers/col.jpg?ver=d7e2f2f18c3349f1069dc6bf1d249e8da84ec62b","abbreviation":"CoL","synopsis":"<p>The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it&rsquo;s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent&rsquo;s east and west separation in order to unite all of the different races, he becomes every race&rsquo;s Child of Light. </p>","language":"Chinese","timeCreated":1430265600.0,"sneakPeek":false,"status":2,"chapterCount":357,"tags":["Chinese","Completed"],"genres":[]},{"id":23,"name":"Battle Through the Heavens","slug":"battle-through-the-heavens","coverUrl":"https://cdn.wuxiaworld.com/images/covers/btth.jpg?ver=b49ecfeb59e7f8a1e94379b5bfa58828e70883a4","abbreviation":"BTTH","synopsis":"<p>In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. &nbsp;Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. &nbsp;His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?</p>","language":"Chinese","timeCreated":1435968000.0,"sneakPeek":false,"status":2,"chapterCount":1648,"tags":["Chinese","Completed"],"genres":["Action","Fantasy","Xuanhuan"]},{"id":65,"name":"Archfiend","slug":"archfiend","coverUrl":"https://cdn.wuxiaworld.com/images/covers/af.png?ver=bd94cfd27cb879943e39bebccfb1a9593dac7274","abbreviation":"AF","synopsis":"<p><strong>Translator General Synopsis:</strong> Qi Condensation. Foundation Establishment. Core Formation. In the current world, only these three realms are known to be achievable. Nascent Soul is but a legend and the realms above it lost to the long river of time. The modern era is known as Cultivation Civilization, a balance of power and civility, excess and moderation. While cultivation remains a secret practice, it has long since exposed itself to the mundane world, quietly intertwined with each facet of society. While the world appears to be at peace, what lies underneath is a conflict between human, cultivator, and demon, brewing for ages and waiting to implode. Yet in the wake of humanity&rsquo;s rapid industrialization, qi&mdash;and consequently cultivation&mdash;is dying.&nbsp;</p><p>Besieged on all sides by forces both human and demon, Xu Yangyi, our protagonist, strives to reach the apex, armed only with esoteric knowledge and his cool pragmatism, and to avenge the unjust deaths of both his parents. Embroiled in conspiracy and with adversity waiting at each turn, he is undeterred in his conquest to seek the Grand Dao and break free of this world&rsquo;s shackles, claiming his title as the pioneer of an era!</p><p dir=\"ltr\"><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>Translator&rsquo;s Technical Synopsis:</strong>&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Archfiend</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">&nbsp;is a novel on Zongheng categorized as a &ldquo;different city&rdquo; novel. It starts in the year 2016 and is supposed to exist in our world. The novel combines elements from the modern city genre and the classic xianxia genre to create a story that I feel is very different from what most readers are used to.&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Archfiend</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">&nbsp;draws heavily on Chinese myth, history, and culture to form an engrossing, but slow, plotline.&nbsp;</span></p><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">The author&rsquo;s past works include&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Super Entertainment Dynasty&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">and&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">The Emperor&rsquo;s Super Star Cultivation System</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">. Both of them are classified as city novels. Hellsing is primarily known as a &ldquo;city-genre&rdquo; writer.&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Archfiend&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">is his first foray into writing a more action-packed story and what he considers his &ldquo;transformative work&rdquo;. Due to his background in the city genre, the author gives&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Archfiend&nbsp;</span><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">with what I feel is a fuller and deeper feeling. I will say that reading and treating this novel as a normal cultivation story isn&rsquo;t the right approach.</span></p><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>Author Synopsis:</strong> <span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">As others blindly search for the truth, remember every living thing is false. As others are restricted by morality and law, remember that all matters are permitted. We walk in darkness and serve in the light. I am Xu Yangyi, I am&hellip; a demon slayer.</span></span></p>","language":"Chinese","timeCreated":1497139200.0,"sneakPeek":false,"status":1,"chapterCount":419,"tags":["Chinese","Ongoing"],"genres":["Action","Alchemy","Fantasy","Mature","Modern Setting","Mystery"]},{"id":22,"name":"Ancient Strengthening Technique","slug":"ancient-strengthening-technique","coverUrl":"https://cdn.wuxiaworld.com/images/covers/ast.jpg?ver=3113ede98eb17afea8006f0024b2290aecd68c05","abbreviation":"AST","synopsis":"<p><strong>Synopsis:</strong></p><p>A human warrior cultivating the Ancient Strengthening Technique has transcended dimensions and arrived on Kyushu. Together with twelve ravishing beauties with looks that were unmatched in their generation, will he be able to stand on the summit of this world?</p><p>This novel is about the main character, named Qing Shui, who transcended dimensions and arrived in the world of nine continents. Storms of blood and wind, resulting in corpses and bones strewn about are extremely common here. The young warrior Qing Shui forged ahead in his path to cultivate, using 10 years to train himself, only to seek vengeance for the one who had forsaken his mother! On the road, he had a chance encounter with the cold beauty (ice princess) Shi Qing Zhuang, incurring hatred and vengeance from her fianc&eacute;e &ndash; Situ Bu Fan. After entering the Hundred Miles City, Qing Shui got acquainted with a dignified and beautiful lady named Yu He and other Xian Tian Realm cultivators &ndash; After which, he willingly invited tribulation on himself, after killing the young master of the Gong Yang Clan because of Yu He, and was forced into a corner. Luckily for Qing Shui, a lady as beautiful as a celestial maiden named Yi Ye Jian Ge rushed back to save him from afar, following which a bloody battle ensued. Can Qing Shui turn danger into safety, averting disaster? And his relationships with the various beautiful ladies, what will it develop into?</p>","language":"Chinese","timeCreated":1480464000.0,"sneakPeek":false,"status":1,"chapterCount":2406,"tags":["Chinese","Ongoing"],"genres":["Action","Alchemy","Comedy","Cooking","Crafting","Fantasy","Mature","Romance","Xuanhuan"]},{"id":21,"name":"Against the Gods","slug":"against-the-gods","coverUrl":"https://cdn.wuxiaworld.com/images/covers/atg.jpg?ver=b6377e1043744b345c0bdf83557f8b89a8018e94","abbreviation":"ATG","synopsis":"<p><span style=\"font-weight: 700; border: 0px; font-style: inherit; margin-right: 0px; margin-left: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\">Custom Synopsis:&nbsp;</span>Hunted for possessing a heaven-defying object, Yun Che is a young man in both that life and the next. Throwing himself off a cliff to spite his pursuers, Yun Che is reincarnated as Xiao Che, a recently poisoned teen in another realm. Just as hated in this life as the previous one, Che must overcome his own hostile clan, his own inability to cultivate, and his own frosty fianc&eacute;e.</p>","language":"Chinese","timeCreated":1434153600.0,"sneakPeek":false,"status":1,"chapterCount":1468,"tags":["Chinese","Ongoing"],"genres":["Action","Comedy","Fantasy","Mature","Mystery","Romance","Xuanhuan"]},{"id":20,"name":"A Will Eternal","slug":"a-will-eternal","coverUrl":"https://cdn.wuxiaworld.com/images/covers/awe.jpg?ver=ad5a9a488196bf8529f2b6ec5a919531f8e57f52","abbreviation":"AWE","synopsis":"<p>A Will Eternal is the fourth major xianxia novel by the renowned Er Gen. It tells the tale of Bai Xiaochun, an endearing but exasperating young man who is driven primarily by his fear of death and desire to live forever, but who deeply values friendship and family. The story takes place in the same Universe as Er Gen&#39;s other novels, but is a separate story and can be read alone. That said, it does have connections to the other novels, especially <a href=\"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens\">I Shall Seal the Heavens</a>. Those connections only pertain to a handful of chapters, so you can read the novel as a whole and enjoy it without first reading ISSTH. However, the best reading experience would begin with the later portions of ISSTH. This novel is much more comedic and light-hearted than Er Gen&#39;s previous works, although it has its fair share of action and drama.&nbsp;</p>","language":"Chinese","timeCreated":1481328000.0,"sneakPeek":false,"status":2,"chapterCount":1317,"tags":["Chinese","Completed"],"genres":["Action","Alchemy","Comedy","Fantasy","Political Intrigue","Xianxia"]},{"id":19,"name":"A Record of a Mortal’s Journey to Immortality","slug":"rmji","coverUrl":"https://cdn.wuxiaworld.com/images/covers/rmji.jpg?ver=9362efd8d11b4b8bc976f449e4f7f1a4e0c27c08","abbreviation":"RMJI","synopsis":"<p><strong>Synopsis:</strong></p><p>A poor and ordinary boy from a village joins a minor sect in Jiang Hu and becomes an Unofficial Disciple by chance. How will Han Li, a commoner by birth, establish a foothold for himself in in his sect? With his mediocre aptitude, he must successfully traverse the treacherous path of cultivation and avoid the notice of those who may do him harm. This is a story of an ordinary mortal who, against all odds, clashes with devilish demons and ancient celestials in order to find his own path towards immortality.</p>","language":"Chinese","timeCreated":1482624000.0,"sneakPeek":false,"status":1,"chapterCount":1057,"tags":["Chinese","Ongoing"],"genres":[]},{"id":1,"name":"7 Killers","slug":"7-killers","coverUrl":"https://cdn.wuxiaworld.com/images/covers/7k.png?ver=9b915c064823d7f0189651b7936c37f9cca9c355","abbreviation":"7K","synopsis":"<p>Dragon Fifth is a powerful lord with incredible martial arts, and yet is wasting away from a fatal disease. The only medicine which can cure his sickness lies in the clutches of his venomous ex-wife, Madam Lovesickness, and is guarded by seven dangerous killers, fugitives of the martial world. Into this treacherous love spat tumbles Liu Changjie, a skilled martial artist who loves drinking and women, but has a mysterious past. All is not what it seems in this wuxia heist story. Can you decipher the mystery before the final reveal? (There are only seven chapters in this novel, but they are very long chapters. In total, the story is of equal length to roughly 20-25 average web novel chapters)</p>","language":"Chinese","timeCreated":1424995200.0,"sneakPeek":false,"status":2,"chapterCount":8,"tags":["Chinese","Completed"],"genres":["Action","Mystery","Romance","Wuxia"]}],"result":true}